# ベースイメージとしてGoの公式イメージを使用
FROM golang:1.23

# コンテナ内での作業ディレクトリを設定
# 以降のコマンドは、このディレクトリ内で実行される
WORKDIR /app

# ホストマシン（あなたのPC）上のプロジェクトディレクトリにあるGoモジュールと依存関係を
# コンテナの作業ディレクトリにコピーする
COPY go.mod .
COPY go.sum .

# プロジェクト全体のコピー
# アプリケーションのソースコードやその他のファイルがすべてコンテナ内に入る
COPY . .

WORKDIR /app/cmd/server

# go.modとgo.sumに基づいて、Goプロジェクトに必要な依存パッケージをダウンロードし、
# コンテナ内にインストール
RUN go mod download

# アプリケーションをビルド
# -o /grpc-chat-serverは、ビルドされた実行ファイルの名前と出力先を指定している
# この実行ファイルが、後でコンテナ内で実行されるgRPCサーバーになる
RUN go build -o /grpc-chat-server

# コンテナがリッスンするネットワークポートを指定
# これにより、コンテナ外部から50051番ポートを通じてgRPCサーバーにアクセスできるようになる
EXPOSE 8080

# CMDは、コンテナが起動したときに実行されるコマンドを指定するもの
# ここでは、先ほどビルドした/grpc-chat-serverという実行ファイルを実行するよう指定している
# これにより、コンテナが起動すると、自動的にgRPCサーバーが立ち上がり、リクエストを受け付ける状態になる
CMD ["/grpc-chat-server"]
